In [1]:
import pandas as pd

In [3]:
pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|')

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [4]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|')

In [5]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [10]:
users.groupby('occupation').age.describe()

               count       mean        std   min    25%   50%    75%   max
occupation
administrator   79.0  38.746835  11.123397  21.0  30.00  37.0  48.00  70.0
artist          28.0  31.392857   8.668116  19.0  25.00  30.0  39.00  48.0
doctor           7.0  43.571429  12.501428  28.0  35.50  45.0  48.50  64.0
educator        95.0  42.010526  10.413264  23.0  33.00  42.0  50.00  63.0
engineer        67.0  36.388060  11.199236  22.0  28.00  36.0  43.00  70.0
entertainment   18.0  29.222222  10.056052  15.0  23.00  25.0  33.00  50.0
executive       32.0  38.718750  10.608075  22.0  31.00  38.5  46.00  69.0
healthcare      16.0  41.562500  11.313524  22.0  30.50  44.5  49.25  62.0
homemaker        7.0  32.571429  10.737119  20.0  24.50  32.0  38.50  50.0
lawyer          12.0  36.750000  10.830303  21.0  28.75  34.0  47.75  53.0
librarian       51.0  40.000000  11.023611  23.0  30.00  39.0  49.00  69.0
marketing       26.0  37.615385   9.474500  24.0  30.25  36.0  42.50  55.0
none             9.0  26.555556  13.757826  11.0  16.00  26.0  33.00  55.0
other          105.0  34.523810  10.738227  13.0  26.00  32.0  44.00  64.0
programmer      66.0  33.121212   9.624512  20.0  27.00  30.0  38.00  63.0
retired         14.0  63.071429   5.757461  51.0  60.00  63.0  67.25  73.0
salesman        12.0  35.666667  14.079859  18.0  28.25  34.0  38.25  66.0
scientist       31.0  35.548387   7.392964  23.0  30.00  37.0  40.00  55.0
student        196.0  22.081633   5.284081   7.0  19.00  21.0  25.00  42.0
technician      27.0  33.148148   9.867210  21.0  24.00  30.0  40.00  55.0
writer          45.0  36.311111  11.423306  18.0  26.00  36.0  48.00  60.0

In [12]:
users.groupby(['gender','occupation']).count()

                      user_id  age  zip_code
gender occupation
F      administrator       36   36        36
       artist              13   13        13
       educator            26   26        26
       engineer             2    2         2
       entertainment        2    2         2
       executive            3    3         3
       healthcare          11   11        11
       homemaker            6    6         6
       lawyer               2    2         2
       librarian           29   29        29
       marketing           10   10        10
       none                 4    4         4
       other               36   36        36
       programmer           6    6         6
       retired              1    1         1
       salesman             3    3         3
       scientist            3    3         3
       student             60   60        60
       technician           1    1         1
       writer              19   19        19
M      administrator       43   43        43
       artist              15   15        15
       doctor               7    7         7
       educator            69   69        69
       engineer            65   65        65
       entertainment       16   16        16
       executive           29   29        29
       healthcare           5    5         5
       homemaker            1    1         1
       lawyer              10   10        10
       librarian           22   22        22
       marketing           16   16        16
       none                 5    5         5
       other               69   69        69
       programmer          60   60        60
       retired             13   13        13
       salesman             9    9         9
       scientist           28   28        28
       student            136  136       136
       technician          26   26        26
       writer              26   26        26

In [13]:
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [14]:
def gender_to_number(x):
    if x == 'F':
        return 0
    else:
        return 1
users['gender_n'] = users.gender.apply(gender_to_number)

   user_id  age gender  occupation zip_code  gender_n
0        1   24      M  technician    85711         1
1        2   53      F       other    94043         0
2        3   23      M      writer    32067         1
3        4   24      M  technician    43537         1
4        5   33      F       other    15213         0

In [15]:
users

     user_id  age gender     occupation zip_code  gender_n
0          1   24      M     technician    85711         1
1          2   53      F          other    94043         0
2          3   23      M         writer    32067         1
3          4   24      M     technician    43537         1
4          5   33      F          other    15213         0
..       ...  ...    ...            ...      ...       ...
938      939   26      F        student    33319         0
939      940   32      M  administrator    02215         1
940      941   20      M        student    97229         1
941      942   48      F      librarian    78209         0
942      943   22      M        student    77841         1

[943 rows x 6 columns]

In [16]:
a = users.groupby('occupation').gender_n.sum() / users.occupation.value_counts() * 100

occupation
administrator     54.430380
artist            53.571429
doctor           100.000000
educator          72.631579
engineer          97.014925
entertainment     88.888889
executive         90.625000
healthcare        31.250000
homemaker         14.285714
lawyer            83.333333
librarian         43.137255
marketing         61.538462
none              55.555556
other             65.714286
programmer        90.909091
retired           92.857143
salesman          75.000000
scientist         90.322581
student           69.387755
technician        96.296296
writer            57.777778
dtype: float64

In [18]:
a.sort_values(ascending=False)

occupation
doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

In [20]:
users.groupby('occupation').age.agg(['mean','median','count'])

                    mean  median  count
occupation
administrator  38.746835    37.0     79
artist         31.392857    30.0     28
doctor         43.571429    45.0      7
educator       42.010526    42.0     95
engineer       36.388060    36.0     67
entertainment  29.222222    25.0     18
executive      38.718750    38.5     32
healthcare     41.562500    44.5     16
homemaker      32.571429    32.0      7
lawyer         36.750000    34.0     12
librarian      40.000000    39.0     51
marketing      37.615385    36.0     26
none           26.555556    26.0      9
other          34.523810    32.0    105
programmer     33.121212    30.0     66
retired        63.071429    63.0     14
salesman       35.666667    34.0     12
scientist      35.548387    37.0     31
student        22.081633    21.0    196
technician     33.148148    30.0     27
writer         36.311111    36.0     45